Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔས་གཟུགས་ཀྱི་རང་བཞིན་རབ་ཏུ་ཤེས་ཤིང་དེ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཡང་རབ་ཏུ་སྟོན་པ་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: Bodhisattvas who correctly understand the nature of form and convey this to sentient beings become irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་ངས་འདོད་པའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། མངོན་པར་འདུས་བྱས་པའི་བར་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ་ཡང་དག་པར་རབ་ཏུ་བསྟན་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the origin as related to knowledge of the defilement of desire. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the origin as related to knowledge of the defilement of desire.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དྲང་སྲོང་ཆོས་ལ་ངེས་པ་ཞེས་བྱ་བ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there was a sage named Certain in the Dharma.

source: རྫུ་འཕྲུལ་ཆེ་བ། གཟི་བརྗིད་ཆེ་བ། མཐུ་ཆེ་བ། ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པ་རྣམས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཞིག་བྱུང་ངོ་། །
en: This sage possessed tremendous miraculous powers and splendor, and he had attained freedom from attachment to pleasures by means of the outer path.

source: དེ་འདོད་པའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ། མེ་ལོང་གི་དཀྱིལ་འཁོར་དུ་སྣང་བ་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་ཏེ།
en: Just like looking at reflections in a mirror, the sage correctly understood the origin as related to knowledge of the defilement of desire.

source: ཇི་ལྟར་མེ་ལོང་གི་དཀྱིལ་འཁོར་གྱི་གཟུགས་ཀྱི་རྣམ་པ་མཐོང་བ་མེད་པ་དེ་ལྟར་འདོད་པའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་མཐོང་བ་ཡང་མེད་དོ། །
en: Thus, just as there are no actual forms to be seen within a mirror, the sage did not perceive any knowledge of the origin as related to knowledge of the defilement of desire.

source: དངོས་པོ་ཡང་དག་པ་མ་ཡིན་པའི་ཕྱིར་ཏེ།
en: Because those are not real entities.

source: ཆོས་གང་དངོས་པོ་མེད་པ་དེ་སྤང་བར་མི་བྱ། ཡོངས་སུ་ཤེས་པར་མི་བྱ། བསྒོམ་པར་མི་བྱ། མངོན་སུམ་དུ་མི་བྱ་བ་ཡིན་ན།
en: When something does not exist as an entity, it cannot be relinquished, comprehended, cultivated, or perceived.

source: འདི་ལྟར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐོས་པ་དང་མི་ལྡན་པ་འདོད་པའི་ཡོན་ཏན་དོན་དུ་གཉེར་བ་དེ་དག་དེའི་རྣམ་པ་ལ་སྤྱོད་པར་སྣང་ངོ་། །
en: Childish, ordinary beings, who lack learning and pursue sense pleasures, merely have the impression of being involved with those things.

source: འདི་ལྟ་སྟེ་དཔེར་ན། མེ་ལོང་གི་གཟུགས་ཀྱི་རྣམ་པ་ལ་དེ་ལྟར་ཚུལ་བཞིན་དུ་སོ་སོར་བརྟགས་ན། མངོན་པར་ཤེས་པ་ལྔ་མངོན་སུམ་དུ་བྱས་སོ། །
en: “In this way the sage correctly examined things as if they were the reflections of forms that appear in a mirror, and so he attained the five superknowledges.

source: ཆོས་ཐམས་ཅད་ལ་ཡང་མེ་ལོང་གི་དཀྱིལ་འཁོར་དུ་སྣང་བ་བཞིན་དུ་འདུ་ཤེས་ཐོབ་བོ། །
en: Having achieved a perception of all phenomena being like reflections in a mirror,

source: དེ་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་བཟོད་པ་དེ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: he established innumerably many tens of thousands of beings within the acceptance of that.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན། དྲང་སྲོང་ཆོས་ལ་ངེས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the sage Certain in the Dharma was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། དྲང་སྲོང་ཆོས་ལ་ངེས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Certain in the Dharma,

source: ངས་དེའི་ཚེ་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དེ་དག་མེ་ལོང་གི་དཀྱིལ་འཁོར་དུ་སྣང་བ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་རབ་ཏུ་བཙུད་དོ། །
en: and so I established innumerably many tens of thousands of beings within the absorption in which appearances are like reflections a mirror.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་སོ། །
en: The associated roots of virtue I dedicated to unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔས་མེ་ལོང་གི་དཀྱིལ་འཁོར་དུ་སྣང་བ་ལྟ་བུའི་ཆོས་རྣམས་ལ་སེམས་གཞུག་པར་བྱའོ། །
en: “Therefore, Maudgalyāyana, bodhisattvas must let their minds engage with phenomena as being like the reflections in a mirror.

source: མེ་ལོང་གི་དཀྱིལ་འཁོར་དུ་སྣང་བ་ལྟ་བུའི་ཆོས་རྣམས་ལ་སེམས་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: Bodhisattvas who let their minds engage with phenomena as being like the reflections in a mirror will become irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་ངས་འདོད་པའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་ཞེས་བྱ་བ་ནས། དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དག་མངོན་པར་འདུས་བྱས་པའི་བར་དང་དེ་བཞིན་དུ་རྒྱ་ཆེར་སྦྱར་རོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand cessation as related to knowledge of the defilement of desire. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of cessation as related to knowledge of the defilement of desire.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་ཨུད་ཛྱ་དད་ཏ་ཞེས་བྱ་བ། རྫུ་འཕྲུལ་ཆེ་བ། གཟི་བརྗིད་ཆེ་བ། མཐུ་ཆེ་བ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there was a sage by the name of Ujayadatta, who possessed tremendous miraculous powers , splendor, and ability.

source: གང་བདག་གིས་ཆོས་རྟོགས་པའི་ཆོས་དེ་དག་ལས་ཆེས་མངོན་པར་བྱུང་བའམ། ཆེས་གྱ་ནོམ་པའི་ཆོས་གཞན་གང་ཡང་ཡོད་དམ་སྙམ་མོ། །
en: ‘Might there be anything more perfect and sublime than what I have realized?

source: གང་བདག་གིས་ཆོས་ཁོང་དུ་ཆུད་པ་དེ་དག་ནི་འགོག་པའི་ཆོས་སོ། །
en: Well, what I have comprehended are all phenomena that are subject to cessation.

source: ཆོས་གང་འགོག་པ་མེད་པའི་ཆོས་དེ་གོང་དུ་ཆེས་མངོན་པར་བྱུང་བ་དང་། ཆེས་གྱ་ནོམ་པར་འགྱུར་རོ་སྙམ་མོ། །
en: Something that knows no cessation would be more perfect and sublime than that.

source: ཆོས་གང་དག་སྐྱེས་པ་དེ་དག་ནི་འགོག་པའི་ཆོས་ཡིན་ལ། གང་སྐྱེས་པ་མེད་པ་དེ་དག་ནི་འགོག་པ་མེད་པའི་ཆོས་སོ་སྙམ་མོ། །
en: All phenomena that arise are subject to cessation, whereas phenomena that do not arise are not subject to cessation.

source: ཆོས་གང་སྐྱེས་པ་མེད་པ་དེ་གང་ཡིན།
en: So, what would be an unborn phenomenon?

source: ཡང་དག་པ་མ་ཡིན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་ཀྱིས་མ་སྐྱེས་པ་ཡིན་ཏེ།
en: By their very nature all phenomena are unborn, because they are not real.

source: ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་མེད་པ་ཡིན།
en: Thus, all phenomena lack any essential nature.

source: ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་དང་བྲལ་བ་ཡིན་ནོ། །
en: All phenomena are devoid of any essential nature.

source: དེ་ལྟ་བས་ན་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི་མ་སྐྱེས་པའོ། །
en: Hence, the essential nature of all phenomena is unborn.’

source: དེ་དེ་ལྟར་ཚུལ་བཞིན་དུ་སོ་སོར་རྟོག་པ་ན་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ། །
en: “As the sage inquired in this way he attained acceptance that phenomena are unborn.

source: དེས་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་དེ་ལ་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་རབ་ཏུ་བཙུད་དེ། དོན་ཀྱང་འཛིན་ཏུ་བཅུག་གོ། །
en: He went on to establish innumerably many tens of thousands of beings within that acceptance and made them uphold that.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན། དྲང་སྲོང་ཨུད་ཛྱ་དད་ཏ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the sage Ujayadatta was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཨུད་ཛྱ་དད་ཏ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Ujayadatta.

source: ངས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་རབ་ཏུ་བཙུད་ཅིང་། དོན་དམ་པ་ཡང་འཛིན་ཏུ་བཅུག་གོ། །
en: In this way I established innumerably many tens of thousands of beings within the acceptance that phenomena are unborn, and thus I made them uphold the ultimate.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔས་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་རབ་ཏུ་གནས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must abide by the acceptance that phenomena are unborn.

source: མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: A bodhisattva who abides in the acceptance that phenomena are unborn will quickly awaken to unsurpassed and perfect buddhahood.

source: མཽད་གལ་གྱི་བུ་ངས་འདོད་པའི་ཟག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ནས། མངོན་པར་འདུས་བྱས་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the path that leads to cessation as related to knowledge of the defilement of desire. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the path that leads to cessation as related to knowledge of the defilement of desire.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དྲང་སྲོང་ལྷག་མཐོང་སྤྱད་པ་ཞེས་བྱ་བ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage known as Engaging with Special Insight.

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་ལ་མཐུ་ཆེ་བ། ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པ་རྣམས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཞིག་བྱུང་ངོ་། །
en: This sage possessed tremendous miraculous powers and splendor, and had attained freedom from attachment to pleasures by means of the outer path.

source: འདོད་པའི་ཟག་པ་འབྱུང་བ་གང་ཡོད།
en: ‘What are the emerging defilements of desire?

source: གང་མེད་ན་མི་འབྱུང་ངོ་། །
en: If they are nothing, they do not emerge.

source: འབྱུང་བ་ནི་ཡུལ་ཡིད་ལ་བྱེད་པ་ལས་གཞན་མ་ཡིན་ཏེ།
en: Such defilements emerge solely by keeping an object in mind.

source: ཡིད་ལ་བྱེད་པ་མེད་པས་ནི་མི་འབྱུང་ངོ་། །
en: If nothing is held in mind no defilement will arise.

source: འདོད་པའི་ཟག་པ་འགོག་པ་ལས་གཞན་མ་ཡིན་པ་འདི་ནི་ལམ་ཡིན་ནོ་སྙམ་མོ། །
en: This, which is none other than the cessation of the defilements of desire, is the path.’

source: དེ་དེ་ལྟར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ན། འདོད་པའི་ཟག་པ་བདག་མེད་པའི་ཕྱིར། ཡང་དག་པའི་དོན་གྱི་ལམ་བསྐྱེད་དོ། །
en: “By contemplating correctly in this way, the sage gave rise to the path of ultimate reality, because the defilements of desire are devoid of self.

source: ཇི་ལྟར་ལམ་འདིས་འདོད་པའི་ཟག་པ་འགགས་ནས། མི་སྐྱེ་བ་དེ་བཞིན་དུ་ལམ་འདིས་ཟག་པ་ཐམས་ཅད་འགགས་ཏེ་མི་སྐྱེའོ། །
en: When, by means of this path, he had brought an end to the defilements of desire, so that they did not recur, he used the same path to end all defilements from future recurrence.

source: དེ་དེ་ལྟར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པས་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་བོ། །
en: Thus, by correctly contemplating in this way, he attained the five superknowledges,

source: མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་ནས། སྐྱེ་བོའི་ཚོགས་མང་པོ་མངོན་པར་ཤེས་པ་ལྔ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: and with that attainment he became able to establish numerous other beings in the five superknowledges as well.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན། དྲང་སྲོང་ལྷག་མཐོང་སྤྱད་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the sage Engaging with Special Insight was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། དྲང་སྲོང་ལྷག་མཐོང་སྤྱད་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Engaging with Special Insight.

source: ངས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་ཤེས་པ་ལྔ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: Thus I established innumerably many tens of thousands of beings within the five superknowledges.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། !བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ལམ་དེ་དག་ལ་ཀུན་ཏུ་བསྟན་པར་བྱ། བསྒོམ་པར་བྱ། མང་དུ་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas who wish to awaken to unsurpassed and perfect buddhahood must rely on, cultivate, and enhance these paths.

source: མངོན་པར་ཤེས་པ་ལྔ་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕན་པ་བྱེད་པར་འགྱུར་རོ། །
en: A bodhisattva who is accomplished in the five superknowledges will benefit all beings.”

source: མཽད་གལ་གྱི་བུ་ངས་སྲིད་པའི་ཟག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ནས། མངོན་པར་འདུས་བྱས་པའི་བར་དང་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the defilement of existence. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the defilement of existence.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དྲང་སྲོང་སྲིད་པ་ལ་དགའ་བ་ཞེས་བྱ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage known as Fond of Existence.

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་ལ་མཐུ་ཆེ་བ། ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པ་རྣམས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཞིག་བྱུང་སྟེ།
en: He possessed tremendous miraculous powers and splendor, and had attained freedom from attachment to pleasures by means of the outer path.

source: སྲིད་པ་ལ་སྙིང་པོ་མེད་པར་འདུ་ཤེས། མི་རྟག་པར་འདུ་ཤེས། སྡུག་བསྔལ་བར་འདུ་ཤེས། ཉེས་དམིགས་སུ་འདུ་ཤེས།
en: “This sage knew existence to be pointless, impermanent, painful, and flawed.

source: སྲིད་པ་ཐམས་ཅད་ལ་ངན་པ་དང་། ཟག་པ་དང་དབུགས་དབྱུང་བ་མེད་པ་དང་ཡོངས་སུ་འགྱུར་བའི་ཆོས་ཅན་ཏེ།
en: He thought to himself, ‘All of existence is base, defiled, without relief, and subject to change.

source: སྲིད་པ་ལ་མངོན་པར་དགའ་བའི་སེམས་ཅན་དེ་དག་ནི་སྡུག་བསྔལ་བ་ཡིན་ནོ། །
en: Hence, sentient beings who are fond of existence suffer.

source: འདི་ལྟར་གང་སྲིད་པ་ཞེས་བྱ་བ་དེ་ནི་སྡུག་བསྔལ་འབྱུང་བ་ཡིན་ཏེ།
en: Because “existence” is the arising of suffering,

source: སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་དང་མི་འཐུན་པ། བདེ་བ་འདོད་ན་
en: and no sentient being appreciates suffering. All want happiness.

source: སེམས་ཅན་གང་སྲིད་པ་ལ་མངོན་པར་དགའ་བ་དེ་དག་སྡུག་བསྔལ་ལ་མངོན་པར་དགའ་སྟེ། དེ་དག་བདེ་བ་ཡང་དག་པར་མི་ཤེས་སོ། །
en: Therefore, sentient beings who are fond of existence are fond of suffering and do not know real happiness.

source: སྡུག་བསྔལ་འདིའི་ཀུན་འབྱུང་ནི་འདི་ལྟ་སྟེ། སྲིད་པ་ཡིན་ཏེ། གང་མི་འབྱུང་ན་སྡུག་བསྔལ་དེ་མེད་དོ་སྙམ་མོ། །
en: Because, existence is precisely the arising of suffering. On the other hand, what does not arise, does not involve any suffering.’

source: དེ་དེ་ལྟར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ན། སྲིད་པ་ལ་ཡིད་བྱུང་བར་གྱུར་ཏོ། །
en: “As he contemplated this correctly, the sage became disenchanted by existence

source: དེ་སྲིད་པ་ལ་ཡིད་བྱུང་བ་ནས། སྲིད་པ་ལ་གནས་པར་མི་བྱེད་དོ། །
en: and, since he now felt that way, he no longer remained within existence.

source: འདི་ལྟ་སྟེ་སྲིད་པ་ལ་མི་གནས་པའི་ཤེས་པ་འདི་ནི་མཆོག་དང་། གཙོ་བོ་དང་། ཕུལ་ཡིན་ནོ་སྙམ་ནས།
en: ‘This knowledge, which does not dwell in existence, is supreme, paramount, sublime!’

source: དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས། སྒྲ་འབྱིན་པར་བྱེད་དོ། །
en: Thus, when he arose from his absorption, he proclaimed,

source: སྲིད་པ་ནི་སྡུག་བསྔལ་བའོ། །
en: ‘Existence is suffering!

source: སྲིད་པ་ལ་མི་གནས་པ་ནི་བདེ་བའོ་ཞེས་སྒྲ་དབྱངས་བསྒྲགས་སོ། །
en: Not dwelling in existence is happiness!’

source: དེ་ལྟ་བས་ན་སྲིད་པ་ནི་མི་རྟག་པ་འདུས་བྱས་པ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡིན་ནོ། །
en: “Therefore, existence is impermanent, conditioned, and arises in dependence.

source: དེ་དེ་ལྟར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ན། གནས་མེད་པ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: When this is kept correctly in mind, without abiding, one attains the acceptance that phenomena are unborn.

source: ཇི་ཙམ་དུ་སེམས་ཅན་གནས་མེད་པའི་སྒྲ་ཐོས་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: Whoever hears this message of not abiding will become irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་སྲིད་པ་ལ་དགའ་བ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the sage Fond of Existence was anyone else, do not think so.

source: ང་དེར་གྱུར་ཏོ། །
en: In those days I was that sage.

source: ངས་སྲོག་ཆགས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དེ་དག་གནས་མེད་པའི་སྒྲ་ཐོས་པར་བྱས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བྱས་སོ། །
en: I caused innumerably many tens of thousands of beings to hear that statement of non-dwelling and made them irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔས་སྲིད་པ་གནས་མེད་པ་ཉིད་ལ་བསླབ་པར་བྱ། གཞན་དག་ལ་ཡང་སྲིད་པ་གནས་མེད་པའི་བསྔགས་པ་བརྗོད་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must train in not dwelling in existence, and they must praise this non-dwelling in front of others.

source: མཽད་གལ་གྱི་བུ་ངས་སྲིད་པའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་ཞེས་བྱ་བ་ནས། མངོན་པར་འདུས་བྱས་པའི་བར་དང་། དེ་བཞིན་དུ་བདག་གིས་ཇི་ལྟར་ཞེས་བྱ་བའི་བར་དུ་སྦྱར་རོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the origin as related to knowledge of the defilement of existence.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དྲང་སྲོང་སྲིད་པ་ཞི་བྱེད་ཅེས་བྱ་བ་ནས་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage named Pacifier of Existence.

source: མཐུ་ཆེ་བའི་བར་དང་། ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པ་རྣམས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ།
en: The sage possessed tremendous miraculous powers and splendor and had attained freedom from attachment to pleasures by means of the outer path.

source: སྲིད་པ་དོན་དུ་མི་བྱེད་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: He was also known as He Who Does Not Pursue Existence.

source: དེ་ནས་དྲང་སྲོང་སྲིད་པ་ཞི་བྱེད་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Once he thought to himself,

source: སྲིད་པ་ཞི་བ་ཡོད་པ་འདི་ནི་བདག་ལ་ལེགས་ན། སྲིད་པ་ཞི་བ་དེ་ཡང་མི་ཤེས་ཏེ།
en: ‘Pacification of existence is what I wish for, but I do not know how to accomplish that.

source: ཇི་ལྟར་ན་སྲིད་པ་འཇིག་པར་འགྱུར་བ་འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ།
en: Where might I find a destroyer of existence?

source: བྲམ་ཟེ་སྲིད་པ་ཞི་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་སུ་ཡོད་སྙམ་མོ། །
en: Where might I find a mendicant or brahmin who correctly understands the pacification of existence?’

source: དེའི་ཚེ་དྲང་སྲོང་སྲིད་པ་རིག་པ་ཞེས་བྱ་བས་སྲིད་པ་ཞི་བྱེད་དེ་ལམ་དང་རབ་ཏུ་ལྡན་པའི་སེམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་ན་གཞན་དག་ལ་མི་སྟོན་ཏོ། །
en: “At that point there was a sage called Realizer of Existence, who correctly understood that Pacifier of Existence had developed a mindset in agreement with the path. Knowing that, he did not teach anyone else.

source: ཇི་ལྟར་འདིར་སྲིད་པའི་འདུ་འཛིའི་འདོད་ཆགས་དང་བྲལ་བའི་ཕྱིར་རོ། །
en: Because he was free of any desire for the business of existence.

source: དྲང་སྲོང་སྲིད་པ་ཞི་བྱེད་དེས་དྲང་སྲོང་སྲིད་པ་རྟོགས་པ་སྲིད་པའི་འདུ་འཛིའི་འདོད་ཆགས་དང་བྲལ་ལོ་ཞེས་ཐོས་ནས་དེ་འདི་སྙམ་དུ་སེམས་སོ། །
en: “When the sage Pacifier of Existence heard that the sage Realizer of Existence was free of any desire for the business of existence, he thought,

source: གང་སྲིད་པའི་འདུ་འཛིའི་འདོད་ཆགས་དང་བྲལ་བ་དེ་བདེ་བ་ཡིན་ན། སྲིད་པའི་འདུ་འཛི་ཞེས་བྱ་བ་དེ་དག་གང་ཡིན།
en: ‘Freedom from desire for the business of existence may be blissful, but what is meant by “business of existence”?

source: སྲིད་པའི་རང་བཞིན་ཉོན་མོངས་པའི་འདུ་འཛི་གང་ཡིན་པ་དེ་སྲིད་པའི་འདུ་འཛི་སྟེ།
en: The business of existence must be the afflictive business that is the nature of existence.

source: དེ་ཡང་མཁས་པ་དག་གིས་སྨད་པ་ཡིན་ནོ་སྙམ་ནས།
en: That is also scorned by the wise.’

source: དེ་མཁས་པ་དེ་དག་གི་ཚུལ་ཡང་དག་པར་མཐོང་བ་ན་འདོད་ཆགས་དང་བྲལ་བ་རྗེས་སུ་ཐོབ་བོ། །
en: “Thus, as he accurately perceived the way of the wise, he gained freedom from desire.

source: དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་སྒྲ་འབྱིན་པར་བྱེད་དེ།
en: When he arose from his absorption he proclaimed,

source: ཀྱེ་མ་འདུ་འཛིའི་འདོད་ཆགས་དང་བྲལ་བ་ནི་བདེ་བ་ཡིན་ནོ་ཞེས་སྒྲ་དབྱངས་རྗེས་སུ་བསྒྲགས་སོ། །
en: ‘Ah, freedom from desire for the business of existence is bliss!’

source: དེའི་སྒྲ་དེ་ཡང་ཕྱོགས་བཞིར་རླུང་གིས་ཐོགས་པ་མེད་པར་ཁྱེར་རོ། །སྲོག་ཆགས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དེ་དག་གིས་སྒྲ་ཐོས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: The wind carried the sage’s words unhindered throughout the four directions so that they were heard by innumerably many tens of thousands of beings who became irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན། དྲང་སྲོང་སྲིད་པ་ཞི་བྱེད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the sage Pacifier of Existence was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། དྲང་སྲོང་སྲིད་པ་ཞི་བྱེད་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Pacifier of Existence.

source: ངའི་སྒྲ་དེས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བྱས་སོ། །
en: My voice rendered innumerably many tens of thousands of beings irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་འདུ་འཛི་རྣམ་པར་སྨད་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should despise business.

source: འདུ་འཛི་རྣམ་པར་སྨད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: A bodhisattva who reviles business will quickly become irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་ངས་སྲིད་པའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་ཞེས་བྱ་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། མངོན་པར་འདུས་བྱས་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand cessation as related to knowledge of the defilement of existence.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དྲང་སྲོང་ཤེས་པ་དཔའ་བ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there was a sage named Courageous Knowledge.

source: ཤེས་པ་ཐམས་ཅད་ལ་འཇིགས་པ་མེད་པར་བསྟན་བཅོས་ཁོང་དུ་ཆུད་པར་བྱ་བ་ཐམས་ཅད་ལ་བློ་ཤིན་ཏུ་གནས་པ། བསྟན་བཅོས་བྱེད་པའི་ངོ་བོ་འཛིན་པ་ཐམས་ཅད་ལ་བསླབས་པ་ཞིག་བྱུང་ངོ་། །
en: Undaunted in all fields of knowledge, he understood all the treatises that must be comprehended, and he was trained in terms of all the qualifications of a master of the treatises.

source: ཟག་པ་ཐམས་ཅད་མ་སྐྱེས་ན་འགོག་པར་ངེས་སོ། །
en: ‘Cessation is certain when no defilements occur.

source: འདི་ནི་གནད་ཡིན་ཏེ།
en: This is the vital point.

source: ཕུང་པོ་འགོག་པ་དང་། ཁམས་འགོག་པ་དང་། སྐྱེ་མཆེད་འགོག་པ་དང་། དབང་པོ་འགོག་པ་དང་། བདེན་པ་འགོག་པར་བྱ་བའི་དོན་དུ་གང་ལ་སློབ་པ་དེ་དག་ཕུང་པོ་འགོག་པར་བྱ་བའི་ཕྱིར་ཞུགས་པ་ཡིན་ནོ། །
en: Thus, all the training that is undertaken to bring the aggregates, elements, sense sources, faculties, and truths to cessation is pursued for the very purpose of bringing the aggregates, elements, sense sources, faculties, and truths to cessation.

source: ཁམས་དང་། སྐྱེ་མཆེད་དང་། དབང་པོ་དང་། བདེན་པ་འགོག་པར་བྱ་བའི་ཕྱིར་ཞུགས་པ་ཡིན་ནོ། །
en: The one who comprehends this vital point has accomplished the scholar’s task.

source: གང་གནད་རབ་ཏུ་ཤེས་པ་འདི་ནི་མཁས་པའི་བྱ་བ་བྱས་པ་ཡིན་ཏེ། ཕུང་པོའི་གནད་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ་ཁམས་དང་། སྐྱེ་མཆེད་དང་། དབང་པོ་དང་། བདེན་པའི་གནད་དོ། །
en: This is the key point of the aggregates, elements, sense sources, faculties, and truths.
